==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
VoxelCompletionTransformer               [1, 1, 16, 16, 16]        --
├─Conv3d: 1-1                            [1, 96, 16, 16, 16]       192
├─PositionalEncoding3D: 1-2              [1, 96, 16, 16, 16]       3,145,728
├─ModuleList: 1-3                        --                        --
│    └─VoxelTransformerLayer3D: 2-1      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-1               [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-2      [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-3               [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-4               [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-5              [1, 96, 16, 16, 16]       74,208
│    └─VoxelTransformerLayer3D: 2-2      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-6               [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-7      [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-8               [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-9               [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-10             [1, 96, 16, 16, 16]       74,208
│    └─VoxelTransformerLayer3D: 2-3      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-11              [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-12     [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-13              [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-14              [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-15             [1, 96, 16, 16, 16]       74,208
│    └─VoxelTransformerLayer3D: 2-4      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-16              [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-17     [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-18              [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-19              [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-20             [1, 96, 16, 16, 16]       74,208
│    └─VoxelTransformerLayer3D: 2-5      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-21              [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-22     [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-23              [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-24              [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-25             [1, 96, 16, 16, 16]       74,208
│    └─VoxelTransformerLayer3D: 2-6      [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-26              [1, 96, 16, 16, 16]       192
│    │    └─SpatialAttention3D: 3-27     [1, 96, 16, 16, 16]       37,680
│    │    └─Dropout3d: 3-28              [1, 96, 16, 16, 16]       --
│    │    └─GroupNorm: 3-29              [1, 96, 16, 16, 16]       192
│    │    └─Sequential: 3-30             [1, 96, 16, 16, 16]       74,208
├─GroupNorm: 1-4                         [1, 96, 16, 16, 16]       192
├─Conv3d: 1-5                            [1, 1, 16, 16, 16]        97
==========================================================================================
Total params: 3,819,841
Trainable params: 3,819,841
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 2.74
==========================================================================================
Input size (MB): 0.02
Forward/backward pass size (MB): 217.09
Params size (MB): 15.27
Estimated Total Size (MB): 232.37
==========================================================================================